from expert_system import *


rules = {
    'default': Ask(['y','n']),
    'сезон 2021': Ask(['зима 2021','весна 2021','лето 2021','осень 2021']),
    'хронометраж': Ask(['сериал','полнометражный фильм']),
    'романтика': If(OR(['Сёнен-ай','Сёдзё-ай,' Сёдзё'])),
    'гарем': If(['женский гарем', 'мужской гарем']),
    'ужасы': If(['психология','сверхъестественное']),
    'сеттинг': Ask(['реальный мир','альтернативный мир']),
    'боевик': If(['боевые искусства','меха']),
    'аниме:корзинка фруктов: финал': If(['сериал', 'весна 2021', ' Сёдзё']),
    'аниме:у меня мало друзей': If(['гарем', 'женский гарем', 'сериал']),
    'аниме:отчет о буйстве духов': If(['боевик', 'сериал', 'боевые искусства']),
    'аниме:девочка, которая видит это': If(['ужасы', 'сериал', 'сверхъестественное', 'осень 2021']),
    'аниме:одноклассник': If(['полнометражный фильм', 'Сёнен-ай', 'романтика']),
    'аниме:двуличный братик': If(['лето 2021', реальный мир']),
    'аниме:девушка-монстр': If(['женский гарем', 'альтернативный мир', OR(['романтика', 'ужасы'])])

}
